Repository: Battmobility/be.battmobiel.onboarding
Catalog: lib/src/util/l10n/intl_*.arb
Languages: nl

# formTitle
source: Become a Battmobility member
nl: Word Batt

# moreInfoButtonLabel
source: Why do we ask you this?
nl: Waarom vragen we dit?

# stepIndicatorText
source: Step {step} of {totalSteps}
nl: Stap {step} van {totalSteps}

# introPageNeededDocuments
source: Before continuing, make sure that you have the following documents nearby: • Identity document (Belgian eId, Proof of residence, ...) • Drivers license
nl: Welkom bij Batt! Voor je verder gaat, zorg zeker dat je volgende documenten in de buurt hebt: • Identiteitsdocument (Belgische eId, elektronische vreemdelingenkaart ...) • Rijbewijs

# introPageCancelButtonText
source: Continue later
nl: Ga een andere keer verder

# cancelButtonText
source: Cancel
nl: Annuleer

# previousButtonText
source: Previous
nl: Vorige

# nextButtonText
source: Next
nl: Volgende

# laterButtonText
source: I''ll do this later
nl: Ik vul dit later aan

# doneButtonText
source: Done
nl: Klaar

# continueLaterDialogTitle
source: Continue later?
nl: Later verderdoen?

# continueLaterDialogMessage
source: Do you want to continue at a later point? You can always resume this process later, your data will be there.
nl: Wil je een andere keer verder doen? We houden wat je al ingevuld had bij voor je.

# continueLaterDialogOptionContinueLater
source: Continue later
nl: Ga leter verder

# continueLaterDialogOptionContinueNow
source: Continue now
nl: Ga nu verder

# scanBackIdButtonLabel
source: Get values from ID card
nl: Vul in met id-kaart

# fillOutBeforeContinuing
source: Please fill out all fields before continuing
nl: Vul alle velden in om verder te gaan

# convictionsPageTitle
source: Legal information
nl: Misdrijven of veroordelingen

# convictionsPageMessage
source: For insurance reasons, we need to ask you to provide information about any previous convictions.
nl: Om verzekeringsredenen zijn wij verplicht u een aantal vragen rond eerdere misdrijven of veroordelingen in het verkeer te stellen.

# convictionsPageFooter
source: By checking this box, I declare the information entered on this page to be truthful and to accept any liability in the case it is not.
nl: Door dit vak aan te kruisen verklaar ik dat alle op deze pagina ingevulde informatie waar is en aanvaard ik de aansprakelijkheid indien dit niet zo is.

# convictionTypeDrunk
source: Driving under the influence of alcohol
nl: Besturen van een voertuig onder de invloed van alcohol

# convictionTypeIntoxication
source: Driving under the influence of narcotics
nl: Besturen van een voertuig onder de invloed van andere verdovende stoffen

# convictionTypeTestRefusal
source: Refusal to take a drug test
nl: Het weigeren van een drugtest

# convictionTypeHitAndRun
source: Fleeing the scene of an accident ("hit and run")
nl: Het verlaten van de plaats van een ongeval dat ik veroorzaakt heb (vluchtmisdrijf)

# convictionTypeLicenseRevocation
source: Revocation of license
nl: Intrekken van rijbewijs

# convictionTypeNoOfAccidents
source: How many accidents where you were at fault have you had?
nl: Aantal ongevallen waar u in fout was

# idDocumentsPageTitle
source: ID Documents
nl: Identiteitskaart

# documentsExplainerPageTitle
source: Documents
nl: Documenten

# documentsExplainerPageMessage
source: To complete your registration, we''ll need a few documents
nl: Om je registratie te voltooien, vragen we je in de volgende stap om duidelijke foto''s te maken van zowel de voor- en achterkant van je identiteitskaart als van je rijbewijs (categorie B).

# documentsExplainerPageInfoButtonlabel
source: Why do we need this?
nl: Waarom vragen we dit?

# idDocumentsPageMessage
source: Add pictures of the front and back of your identity document below. Make sure the images are right side up and cropped to show just the document.
nl: Voeg hieronder foto''s van de voor- en achterkant van je identiteitskaart in. Zorg ervoor dat de documenten rechtop staan en correct bijgesneden zijn.

# driversLicensePageTitle
source: Documents
nl: Rijbewijs

# driversLicensePageMessage
source: Add pictures of the front and back of your drivers license below. Make sure the images are right side up and cropped to show just the document.
nl: Voeg hieronder foto''s van de voor- en achterkant van je rijbewijs in. Zorg ervoor dat de documenten rechtop staan en correct bijgesneden zijn.

# identityPageTitle
source: Identity
nl: Identiteit

# identityPageMessage
source: We need to collect some identifying data. These will only be shared with our insurer if necessary.
nl: We hebben enkele van je persoonsgegevens nodig. Deze worden enkel met onze verzekeraar gedeeld indien nodig. Lees meer over ons privacybeleid en hoe we met je gegevens omgaan op https://www.battmobility.be/privacy-voorwaarden/

# identityPageFileRequired
source: Please upload a file.
nl: Kies een bestand.

# idCardFieldTitle
source: Identity document
nl: Identiteitsdocument

# idCardFieldFront
source: Front
nl: Voorzijde

# idCardFieldBack
source: Back
nl: Achterzijde

# driversLicenseFieldTitle
source: Drivers license
nl: Rijbewijs

# driversLicenseFieldFront
source: Front
nl: Voorzijde

# driversLicenseFieldBack
source: Back
nl: Achterzijde

# imagePickerLabelPickPhoto
source: Choose from library
nl: Kies uit bibliotheek

# imagePickerLabelOr
source: or
nl: of

# imagePickerLabelTakePhoto
source: Take a photo
nl: Neem een foto

# imageCropperTitle
source: Crop and rotate
nl: Snij bij en roteer

# imageCropperActionCrop
source: Crop
nl: Snij bij

# imageCropperActionDelete
source: Delete
nl: Wis

# imageCropperDone
source: Done
nl: Klaar

# imageCropperCancel
source: Cancel
nl: Annuleer

# identifyingDataTitle
source: Identity
nl: Identiteit

# firstNameFieldTitle
source: First name
nl: Voornaam

# lastNameFieldTitle
source: Last name
nl: Achternaam

# rrnFieldTitle
source: National identity number
nl: RRN

# birthDateFieldTitle
source: Date of birth
nl: Geboortedatum

source: Drivers license number
nl: Rijbewijsnummer

# driversLicenseIssuedDate
source: Drivers license issued
nl: Datum afgifte

# driversLicenseExpiresDate
source: Drivers license expires
nl: Vervaldatum

# addressPageTitle
source: What is your home address?
nl: Wat is je thuisadres?

# address
source: Adress
nl: Adres

# addressStreet
source: Street
nl: Straat

# addressNumber
source: House number
nl: Huisnummer

# addressAddition
source: Addition
nl: Toevoeging

# addressZip
source: Zip code
nl: Postcode

# addressCity
source: City
nl: Gemeente

# addressCountry
source: Country
nl: Land

# numberHint
source: Numbers only, no spaces or special characters.
nl: Enkel cijfers, geen spaties of speciale tekens.

# phoneEntryPageTitle
source: Enter phone
nl: Wat is je telefoonnummer?

# verificationPageTitle
source: Verify phone
nl: Verifieer telefoonnummer

# verificationPageMessage
source: Select your country code and phone number to verify it.
nl: Selecteer je landcode en geef het nummer in waarop je een code wil ontvangen.

# verificationPageVerifyButtonTitle
source: Send code
nl: Stuur code

# verificationPageConfirmButtonTitle
source: Confirm code
nl: Bevestig code

# verificationPageEnterCodeMessage
source: Please enter the confirmation code that was sent to {phoneNumber}
nl: Voer hieronder de code in die verstuurd werd naar {phoneNumber}

# verificationPageBusyPhone
source: Sending code...
nl: Code versturen

# verificationPageBusyCode
source: Checking code...
nl: Code controleren...

# verificationPageSendCodeFailed
source: Failed to send verification code. Please try again later.
nl: Code versturen mislukt. Probeer het later opnieuw.

# verificationPageCheckPhoneFailed
source: Failed to check phone number. Please try again later.
nl: Code verifiëren mislukt. Probeer het later opnieuw.

# verificationPageVerificationSuccessMessage
source: Verification successful!
nl: Verificatie geslaagd!

# verificationPageVerificationFailureMessage
source: Verification failed!
nl: Verificatie mislukt!

# verificationPageVerificationResend
source: Resend code
nl: Verstuur code opnieuw

# phoneFieldTitle
source: Phone number
nl: Telefoon

# errorPostingMessage
source: We encountered an error processing your data, please try again later
nl: We konden je gegevens niet verwerken, gelieve het later opnieuw te proberen.

# donePageTitle
source: All done!
nl: Klaar!

# donePageMessage
source: You completed the onboarding process, welcome to Batt!
nl: Je hebt alle gegevens ingegeven, welkom bij Batt!

# donePageButtonTitle
source: Close this window
nl: Sluit dit venster

# addSubscriptionFormLabelExistingContracts
source: Your contracts
nl: Bestaande contracten:

# addSubscriptionFormMessageBusinessUse
source: Provide your bussiness details if you want to use BattMobility for your company, or skip this step.
nl: Geef hieronder je facturatiegegevens in als je een zaak hebt:

# addSubscriptionFormLabelNoPersonalUseButton
source: I will not be using BattMobility for personal use.
nl: Ik ga geen persoonlijk gebruik maken van BattMobility.

# addSubscriptionFormNoBusinessButton
source: I will not be using BattMobility for business purposes.
nl: Ik gebruik BattMobility niet voor zakelijke doeleinden

# addSubscriptionFormName
source: Company legal name
nl: Naam

# addSubscriptionFormEmail
source: Company email (billing)
nl: Email

# addSubscriptionFormAddress
source: Company address
nl: Adres

# addSubscriptionFormStreet
source: Street
nl: Straat

# addSubscriptionFormHouseNumber
source: House number + additions
nl: Huisnummer (+ toevoegingen)

# addSubscriptionFormPostalCode
source: Zip code
nl: Postcode

# addSubscriptionFormCity
source: City
nl: Gemeente

# addSubscriptionFormCountry
source: Country
nl: Land

# addSubscriptionFormBusiness
source: For enterprises
nl: Voor bedrijven

# addSubscriptionFormVAT
source: VAT-number (optional)
nl: BTW-nummer (optioneel)

# addSubscriptionFormEnterBusinessData
source: Enter business data
nl: Geef bedrijfsgegevens in

# addSubscriptionFormConfirm
source: Pick a contract
nl: Kies een contract

# addSubscriptionFormSuccess
source: Subscription {subscription} added!
nl: Abonnement {subscription} toegevoegd!

# addSubscriptionFormLoadingFailure
source: Data could not be loaded, please try again.
nl: Data konden niet worden geladen, probeer het alstublieft opnieuw.

# createContractTitle
source: New subscription
nl: Nieuw contract

# createContractPickFormulaLabel
source: Pick a contract
nl: Kies een formule

# createContractConfirmButtonTitle
source: Create contract
nl: Maak contract

# createContractSuccessMessage
source: Contract created successfully!
nl: Contract maken geslaagd!

# createContractFailureMessage
source: Failed to create contract! Try again or contact customer service if the problem persists.
nl: Contract maken mislukt! Probeer het opnieuw of neem contact op met de klantendienst.

# onboardingCompletedTitle
source: Onboarding Complete!
nl: Onboarding Voltooid!

# onboardingCompletedMessage
source: You can download the app, but we will need to verify your documents before you can start using it. You will receive an email with instructions for the warranty payment if applicable.
nl: Gefeliciteerd! Je hebt het onboardingproces succesvol afgerond. Al je contracten zijn nu actief en je kunt de Batt-applicatie gebruiken.

# onboardingCompletedAppStoreMessage
source: Download the Batt mobile app from the App Store to get started.
nl: Download de Batt mobiele app uit de App Store.

# formulaBattFunDescription
source: Comfort fleet without subscription costs
nl: Comfort vloot zonder abonnementskosten

# formulaBattFunPlusDLDescription
source: Luxury fleet, no fixed cost, warranty arranged by your employer.
nl: Luxevloot, geen vaste kost, waarborg geregeld door je werkgever.

# formulaBattFanDescription
source: Comfort fleet + monthly fixed prepaid, 25% discount.
nl: Comfort vloot + maandelijks een vaste prepaid, 25% korting.

# formulaBattFunPlusDescription
source: Luxury fleet without subscription costs
nl: Luxevloot zonder abonnementskosten

# formulaBattFanPlusDescription
source: Luxury fleet + monthly fixed prepaid, 25% discount.
nl: Luxevloot + maandelijks een vaste prepaid, 25% korting.

# formulaBattForBusinessDescription
source: For businesses: luxury fleet at 25% discount
nl: Voor bedrijven: luxevloot aan 25% korting

# noFormulasAvailable
source: No formulas available for this subscription
nl: Geen formules beschikbaar voor dit abonnement

source: Warranty: €{amount}
nl: Waarborg: €{amount}

source: Commitment Amount
nl: Commitment bedrag

source: Enter amount
nl: Voer bedrag in

# commitmentMinimumError
source: Commitment must be at least €{amount}
nl: Commitment moet minstens €{amount} zijn
